---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.TopRailType
source: html/ca17eebb-3ac5-1cad-a978-2c1d93e8a679.htm
---
# TopRailType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.